In [1]:
import pandas as pd
import numpy as np
%matplotlib inline

In [2]:
df=pd.read_csv('C:/Users/HP/Desktop/Gomycode-Ds/Popular_Baby_Names.csv')
print(df.shape)
df.head()

(69214, 6)

   Year of Birth  Gender Ethnicity Child's First Name  Count  Rank
0           2011  FEMALE  HISPANIC          GERALDINE     13    75
1           2011  FEMALE  HISPANIC                GIA     21    67
2           2011  FEMALE  HISPANIC             GIANNA     49    42
3           2011  FEMALE  HISPANIC            GISELLE     38    51
4           2011  FEMALE  HISPANIC              GRACE     36    53

In [24]:
df.columns

Index(['Year of Birth', 'Gender', 'Ethnicity', 'Child's First Name', 'Count',
       'Rank'],
      dtype='object')

Using same case for all the categorical columns

In [27]:
df['Child\'s First Name'].unique()

array(['GERALDINE', 'GIA', 'GIANNA', ..., 'Malani', 'Amoura', 'India'],
      dtype=object)

In [28]:
#columns rename
df.rename(columns={'Child\'s First Name':'Child_Name'}, inplace=True)

In [29]:
df.nunique()

Year of Birth      11
Gender              2
Ethnicity           7
Child_Name       3302
Count             297
Rank              102
dtype: int64

In [31]:
df['Gender']=df['Gender'].apply(lambda x:x.title())

In [36]:
def to_title(row):
    return row.str.title()

In [37]:
obj_dt=df.select_dtypes('object')
obj_dt

       Gender           Ethnicity Child_Name
0      Female            HISPANIC  GERALDINE
1      Female            HISPANIC        GIA
2      Female            HISPANIC     GIANNA
3      Female            HISPANIC    GISELLE
4      Female            HISPANIC      GRACE
...       ...                 ...        ...
69209    Male      BLACK NON HISP     CAYDEN
69210  Female  WHITE NON HISPANIC   Margaret
69211  Female  WHITE NON HISPANIC      Tamar
69212  Female  WHITE NON HISPANIC     Amanda
69213  Female            HISPANIC       ANNA

[69214 rows x 3 columns]

In [38]:
obj_dt=obj_dt.apply(to_title)
obj_dt

       Gender           Ethnicity Child_Name
0      Female            Hispanic  Geraldine
1      Female            Hispanic        Gia
2      Female            Hispanic     Gianna
3      Female            Hispanic    Giselle
4      Female            Hispanic      Grace
...       ...                 ...        ...
69209    Male      Black Non Hisp     Cayden
69210  Female  White Non Hispanic   Margaret
69211  Female  White Non Hispanic      Tamar
69212  Female  White Non Hispanic     Amanda
69213  Female            Hispanic       Anna

[69214 rows x 3 columns]

In [32]:
df['Gender'].unique()

array(['Female', 'Male'], dtype=object)

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69214 entries, 0 to 69213
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year of Birth       69214 non-null  int64
 1   Gender              69214 non-null  object
 2   Ethnicity           69214 non-null  object
 3   Child's First Name  69214 non-null  object
 4   Count               69214 non-null  int64
 5   Rank                69214 non-null  int64
dtypes: int64(3), object(3)
memory usage: 3.2+ MB

In [4]:
df.select_dtypes('number').columns

Index(['Year of Birth', 'Count', 'Rank'], dtype='object')

In [5]:
def string_lower(rows):
    return rows.str.lower()

In [7]:
df['Gender']=string_lower(df['Gender'])

In [8]:
df['Gender']

0        female
1        female
2        female
3        female
4        female
          ...
69209      male
69210    female
69211    female
69212    female
69213    female
Name: Gender, Length: 69214, dtype: object

In [16]:
new_object=df.select_dtypes('object').apply(string_lower)
new_object

       Gender           Ethnicity Child's First Name
0      female            hispanic          geraldine
1      female            hispanic                gia
2      female            hispanic             gianna
3      female            hispanic            giselle
4      female            hispanic              grace
...       ...                 ...                ...
69209    male      black non hisp             cayden
69210  female  white non hispanic           margaret
69211  female  white non hispanic              tamar
69212  female  white non hispanic             amanda
69213  female            hispanic               anna

[69214 rows x 3 columns]

In [17]:
num_val=df.select_dtypes('number')

In [18]:
new_df=num_val.join(new_object)
new_df.head()

   Year of Birth  Count  Rank  Gender Ethnicity Child's First Name
0           2011     13    75  female  hispanic          geraldine
1           2011     21    67  female  hispanic                gia
2           2011     49    42  female  hispanic             gianna
3           2011     38    51  female  hispanic            giselle
4           2011     36    53  female  hispanic              grace